<template>
  <UContainer class="py-8">
    <h1 class="text-xl font-bold mb-6">サイト概要</h1>
    <UCard class="my-5">
      <template #header>
        <p>対応作品</p>
      </template>
      <p>
        <ul>
          <li>th06 東方紅魔郷 EoSD</li>
          <li>th07 東方妖々夢 PCB</li>
          <li>th08 東方永夜抄 IN</li>
          <li>th10 東方風神録 MoF</li>
          <li>th11 東方地霊殿 SA</li>
          <li>th12 東方星蓮船 UFO</li>
          <li>th12.8 妖精大戦争 GFW</li>
          <li>th13 東方神霊廟 TD</li>
          <li>th14 東方輝針城 DDC</li>
          <li>th15 東方紺珠伝 LoLK</li>
          <li>th16 東方天空璋 HSiFS</li>
          <li>th17 東方鬼形獣 WBaWC</li>
          <li>th18 東方虹龍洞 UM</li>
        </ul>
      </p>
    </UCard>
    <UCard class="my-5">
      <template #header>
      <p>基準スコア（大台）</p>
      </template>
      <p>
        <ul>
          <li>th06 東方紅魔郷 : 5億</li>
          <li>th07 東方妖々夢 Extra: 夢符・時符12億 / その他11億</li>
          <li>th07 東方妖々夢 Phantasm: 夢符・時符13億 / その他12億</li>
          <li>th08 東方永夜抄 : 妖夢・ペア24億 / 霊夢・魔理沙・咲夜23億 / 妖怪単騎18億</li>
          <li>th10 東方風神録 : 9.5億</li>
          <li>th11 東方地霊殿 : 10億</li>
          <li>th12 東方星蓮船 : 5億</li>
          <li>th12.8 妖精大戦争 : 9000万</li>
          <li>th13 東方神霊廟 : 5億</li>
          <li>th14 東方輝針城 : 魔理沙B 10億 / 霊夢A・咲夜A・咲夜B 7.5億 / 霊夢B・魔理沙A 7.3億</li>
          <li>th15 東方紺珠伝 : 7億</li>
          <li>th16 東方天空璋 : 20億</li>
          <li>th17 東方鬼形獣 : カワウソ機体 15億 / その他 10億</li>
          <li>th18 東方虹龍洞 : 咲夜 50億 / その他 30億</li>
        </ul>
      </p>
    </UCard>
    <UCard class="my-5">
      <template #header>
      <p>基準スコア（超大台）</p>
      </template>
      <p>
        <ul>
          <li>th06 東方紅魔郷 : 6億</li>
          <li>th07 東方妖々夢 Extra: 夢符 14億 / 時符・霊符 13億 / その他 12億</li>
          <li>th07 東方妖々夢 Phantasm: 夢符 16億 / 時符・霊符 15億 / その他 14億</li>
          <li>th08 東方永夜抄 : 妖夢・ペア 28億 / 魔理沙 26億 / 霊夢・咲夜 25億 / 妖怪単騎 20億</li>
          <li>th10 東方風神録 : 魔理沙C 10億 / 霊夢B・霊夢C 9.9億 / その他 9.85億</li>
          <li>th11 東方地霊殿 : 霊夢A・霊夢B・魔理沙A・魔理沙B 11億 / 霊夢C・魔理沙C 10.5億</li>
          <li>th12 東方星蓮船 : 恋符・蛙符 7億 / 夢符・魔符 6.5億 / 蛇符 6.4億 / 霊符 6.2億</li>
          <li>th12.8 妖精大戦争 : 1億</li>
          <li>th13 東方神霊廟 : 魔理沙・妖夢 6億 / 霊夢・早苗 5.5億</li>
          <li>th14 東方輝針城 : 魔理沙B 12億 / 咲夜B 8.5億 / 霊夢A 8億 / 咲夜A 7.9億 / 霊夢B・魔理沙A 7.5億</li>
          <li>th15 東方紺珠伝 : 9億</li>
          <li>th16 東方天空璋 : 30億</li>
          <li>th17 東方鬼形獣 : カワウソ機体 25億 / その他 15億</li>
          <li>th18 東方虹龍洞 : 咲夜 70億 / その他 35億</li>
        </ul>
      </p>
    </UCard>
    <UCard class="my-5">
      <template #header>
      <p>補足</p>
      </template>
      <p>大台はスコアアタック入門プレイヤーが目標スコアとした際に簡単過ぎず難しすぎず丁度良いくらいの達成難易度となるような基準スコアです。基本的な稼ぎ方を理解していないと出せないスコアなので、この基準値をクリアしたら一人前のスコアラーです。<br />
      超大台はその作品をやり込んだプレイヤーが大目標として掲げるような非常に達成難易度の高い基準スコアです。この基準値をクリアしたらトップスコアラーを名乗っても恥ずかしくないと思います。<br />
      大台・超大台の達成難易度は作品内での整合性・数字のキリの良さを重視していて、異なる作品間での整合性は重視していません。<br />
      例えば紅魔郷5億と地霊殿10億と神霊廟5億は同じ達成難易度ではありませんが、そこは問題視していません。<br />
      機体ごとに基準スコアを設定しているのは難易度格差が極端に広がらないようにするための救済措置であって、全ての機体の達成難易度を揃えるためではありません。<br />
      作品内での整合性については最もスコアが稼げる機体を基準として他の機体ではそれと同等以上の達成難易度を要求しています。<br />
      例えば永夜抄では妖夢24億と比較して難易度が低くならないようにペア、人間単騎、妖怪単騎の基準スコアを設定しています。<br />
      スコアレンジの狭い一部作品では作品内での整合性を取るために基準スコアが細かく設定されています。
    </p>
    </UCard>

    <UCard class="my-5">
      <template #header>
        <p>運営者</p>
      </template>

      <p><a href="https://x.com/flower874_">にゃんこ</a></p>

    </UCard>
    <UCard class="my-5">
      <template #header>
        <p>運用方針</p>
      </template>

      <p>
        このサイトは<a href="https://x.com/flower874_">にゃんこ</a>が運営しているものです。<br/>
        <a href="https://wefma.net">ゑふまいか</a>に作成を依頼し、氏名表示権を除く全ての権利/責任/義務を<a href="https://x.com/flower874_">にゃんこ</a>に譲渡することによって成り立っています。<br/>
        よってこのサイトで何か不都合があれば<a href="https://x.com/flower874_">にゃんこ</a>に問い合わせてください。
      </p>

    </UCard>
  </UContainer>
</template>